### Ref. Datacamp

In [1]:
import pandas as pd

In [9]:
import keras

Using TensorFlow backend.

In [10]:
from keras.layers import Dense

In [11]:
from keras.models import Sequential

In [2]:
dfWages = pd.read_csv('./datasets/hourly_wages.csv')

In [4]:
dfWages.head()

,wage_per_hour,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
0,5.10,0,8,21,35,1,1,0,1,0
1,4.95,0,9,42,57,1,1,0,1,0
2,6.67,0,12,1,19,0,0,0,1,0
3,4.00,0,12,4,22,0,0,0,0,0
4,7.50,0,12,17,35,0,1,0,0,0

In [5]:
dfWages.shape

(534, 10)

In [6]:
dfWages.describe()

,wage_per_hour,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
count,534.000000,534.000000,534.000000,534.000000,534.000000,534.000000,534.000000,534.000000,534.000000,534.000000
mean,9.024064,0.179775,13.018727,17.822097,36.833333,0.458801,0.655431,0.292135,0.185393,0.044944
std,5.139097,0.384360,2.615373,12.379710,11.726573,0.498767,0.475673,0.455170,0.388981,0.207375
min,1.000000,0.000000,2.000000,0.000000,18.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,5.250000,0.000000,12.000000,8.000000,28.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,7.780000,0.000000,12.000000,15.000000,35.000000,0.000000,1.000000,0.000000,0.000000,0.000000
75%,11.250000,0.000000,15.000000,26.000000,44.000000,1.000000,1.000000,1.000000,0.000000,0.000000
max,44.500000,1.000000,18.000000,55.000000,64.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [12]:
Xdata = dfWages.drop(['wage_per_hour'], axis = 'columns')

In [13]:
Xdata.head()

,union,education_yrs,experience_yrs,age,female,marr,south,manufacturing,construction
0,0,8,21,35,1,1,0,1,0
1,0,9,42,57,1,1,0,1,0
2,0,12,1,19,0,0,0,1,0
3,0,12,4,22,0,0,0,0,0
4,0,12,17,35,0,1,0,0,0

In [14]:
ydata = dfWages['wage_per_hour']

In [15]:
Xdata.shape

(534, 9)

Let's start by specifying a model

In [16]:
numberNodes1 = 50
numberNodes2 = 32

In [17]:
model = Sequential()

In [18]:
model.add(Dense(numberNodes1, activation='relu', input_shape = (Xdata.shape[1], )))

In [19]:
model.add(Dense(numberNodes2, activation='relu'))

In [20]:
model.add(Dense(1))